ola31/geekmagic-tv-esp8266/src/webserver.cpp
#include "webserver.h"

#include "config.h"
#include "dashboard.h"
#include "display.h"
#include "feeds.h"
#include "auth.h"
#include "logger.h"
#include "settings.h"
#include "webui.h"
#include <ArduinoJson.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <LittleFS.h>
#include <WiFiManager.h>
#include <ctype.h>

ESP8266WebServer server(WEB_SERVER_PORT);

int currentBrightness = 70;
int currentTheme = 0;
char currentImage[DISPLAY_PATH_BUFFER_SIZE];

extern Settings appSettings;

File uploadFile;

namespace {

using SimpleHandler = void (*)();

Settings savedAppSettings = {};
bool savedSettingsReady = false;
bool factoryResetPending = false;
bool wifiReconfigurePending = false;
String uploadErrorMessage;
int uploadStatusCode = 200;
char uploadTargetPath[DISPLAY_PATH_BUFFER_SIZE] = {0};
String authSessionToken;
unsigned long authSessionLastSeenMs = 0;
int lastEffectiveBrightness = -1;

struct WiFiConnectTask {
    bool queued;
    bool active;
    bool waitingForIp;
    char ssid[33];
    char password[65];
    unsigned long startedAtMs;
    unsigned long ipWaitStartedAtMs;
};

WiFiConnectTask wifiConnectTask = {false, false, false, {0}, {0}, 0, 0};

constexpr unsigned long kWiFiConnectTimeoutMs = 20000UL;
constexpr unsigned long kWiFiIpWaitTimeoutMs = 10000UL;
constexpr unsigned long kAuthSessionDurationMs = 12UL * 60UL * 60UL * 1000UL;
constexpr uint32_t kAuthSessionMaxAgeSec = 12UL * 60UL * 60UL;
constexpr char kAuthSessionCookieName[] = "SCSESSID";

void prepareNoStoreHeaders() {
    server.sendHeader("Cache-Control", "no-store, max-age=0");
    server.sendHeader("Pragma", "no-cache");
    server.sendHeader("Expires", "0");
}

void sendTextResponse(int code, const String &message) {
    prepareNoStoreHeaders();
    server.send(code, "text/plain", message);
}

void sendJsonResponse(int code, const String &json) {
    prepareNoStoreHeaders();
    server.send(code, "application/json", json);
}

void copyString(char *destination, size_t destinationSize, const char *source) {
    if (destinationSize == 0) {
        return;
    }

    if (source == nullptr) {
        destination[0] = '\0';
        return;
    }

    strncpy(destination, source, destinationSize - 1);
    destination[destinationSize - 1] = '\0';
}

void copyConfiguredHostname(char *buffer, size_t bufferSize) {
    settingsBuildHostname(appSettings.deviceName, buffer, bufferSize);
}

void copyDefaultDeviceName(char *buffer, size_t bufferSize) {
    settingsDefaultDeviceName(buffer, bufferSize);
}

bool displaySettingsEqual(const Settings &left, const Settings &right) {
    return left.brightness == right.brightness &&
           left.theme == right.theme &&
           left.gmtOffset == right.gmtOffset &&
           strncmp(left.deviceName, right.deviceName, sizeof(left.deviceName)) == 0;
}

void captureSavedSettings() {
    memcpy(&savedAppSettings, &appSettings, sizeof(savedAppSettings));
    savedSettingsReady = true;
}

bool displayHasDraftChanges() {
    return (savedSettingsReady && !displaySettingsEqual(appSettings, savedAppSettings)) ||
           dashboardHasDraftChanges();
}

void applyEffectiveBrightness(bool syncPreference) {
    int dayBrightness = constrain(appSettings.brightness, 0, 100);
    int desiredBrightness = dashboardEffectiveBrightness(dayBrightness);

    if (syncPreference) {
        currentBrightness = dayBrightness;
        displaySetBrightness(dayBrightness);
        if (desiredBrightness != dayBrightness) {
            displayApplyBrightness(desiredBrightness);
        }
        lastEffectiveBrightness = desiredBrightness;
        return;
    }

    if (lastEffectiveBrightness == desiredBrightness) {
        return;
    }

    displayApplyBrightness(desiredBrightness);
    lastEffectiveBrightness = desiredBrightness;
}

void restoreSavedDisplaySettings() {
    if (!savedSettingsReady) {
        return;
    }

    appSettings.brightness = savedAppSettings.brightness;
    appSettings.gmtOffset = savedAppSettings.gmtOffset;
    appSettings.theme = savedAppSettings.theme;
    copyString(appSettings.deviceName, sizeof(appSettings.deviceName), savedAppSettings.deviceName);
    currentBrightness = appSettings.brightness;
    currentTheme = appSettings.theme;

    configTime(appSettings.gmtOffset, 0, NTP_SERVER);
    applyEffectiveBrightness(true);
}

String cookieValue(const String &cookieHeader, const char *name) {
    if (name == nullptr || name[0] == '\0') {
        return "";
    }

    String prefix = String(name) + "=";
    int headerLength = static_cast<int>(cookieHeader.length());
    int start = 0;
    while (start < headerLength) {
        while (start < headerLength &&
               (cookieHeader.charAt(start) == ' ' || cookieHeader.charAt(start) == ';')) {
            ++start;
        }

        int end = cookieHeader.indexOf(';', start);
        if (end < 0) {
            end = headerLength;
        }

        String part = cookieHeader.substring(start, end);
        part.trim();
        if (part.startsWith(prefix)) {
            return part.substring(prefix.length());
        }

        start = end + 1;
    }

    return "";
}

void clearSessionState() {
    authSessionToken = "";
    authSessionLastSeenMs = 0;
}

String generateSessionToken() {
    char buffer[33];
    for (uint8_t index = 0; index < 4; ++index) {
        uint32_t value = static_cast<uint32_t>(ESP.getCycleCount()) ^
                         static_cast<uint32_t>(micros()) ^
                         static_cast<uint32_t>(millis()) ^
                         static_cast<uint32_t>(random(0x7fffffff));
        snprintf(buffer + (index * 8), sizeof(buffer) - (index * 8), "%08lx", static_cast<unsigned long>(value));
    }
    buffer[32] = '\0';
    return String(buffer);
}

void attachSessionCookie(uint32_t maxAgeSeconds) {
    String cookie = String(kAuthSessionCookieName) + "=" + authSessionToken +
                    "; Path=/; Max-Age=" + String(maxAgeSeconds) +
                    "; HttpOnly; SameSite=Strict";
    server.sendHeader("Set-Cookie", cookie);
}

