ola31/geekmagic-tv-esp8266/src/webserver.cpp
void clearSessionCookie() {
    server.sendHeader("Set-Cookie",
                      String(kAuthSessionCookieName) + "=; Path=/; Max-Age=0; HttpOnly; SameSite=Strict");
}

void startAuthenticatedSession() {
    randomSeed(ESP.getChipId() ^ micros() ^ ESP.getCycleCount() ^ millis());
    authSessionToken = generateSessionToken();
    authSessionLastSeenMs = millis();
}

bool requestHasValidSession() {
    if (authSessionToken.length() == 0) {
        return false;
    }

    if (millis() - authSessionLastSeenMs >= kAuthSessionDurationMs) {
        clearSessionState();
        return false;
    }

    if (!server.hasHeader("Cookie")) {
        return false;
    }

    String cookie = cookieValue(server.header("Cookie"), kAuthSessionCookieName);
    if (cookie.length() == 0 || !cookie.equalsConstantTime(authSessionToken)) {
        return false;
    }

    authSessionLastSeenMs = millis();
    return true;
}

bool ensureAuthenticatedRequest() {
    if (requestHasValidSession()) {
        attachSessionCookie(kAuthSessionMaxAgeSec);
        return true;
    }

    clearSessionCookie();
    sendTextResponse(401, "Unauthorized");
    return false;
}

void registerProtectedRoute(const char *uri, HTTPMethod method, SimpleHandler handler) {
    server.on(uri, method, [handler]() {
        if (!ensureAuthenticatedRequest()) {
            return;
        }

        handler();
    });
}

// True while the device has no usable network of its own and is offering the
// setup AP. The admin account only means anything on a configured network, so
// there is no session to require here; the sole purpose of this state is to let
// someone nearby (re)configure WiFi. Endpoints registered below are therefore
// open in this state and behind auth again once the device is on a network.
// This is what keeps a screen-broken device recoverable over the air.
bool webserverInSetupMode() {
    return wifiFailsafeMode || displayState.apMode;
}

void registerSetupRoute(const char *uri, HTTPMethod method, SimpleHandler handler) {
    server.on(uri, method, [handler]() {
        if (!webserverInSetupMode() && !ensureAuthenticatedRequest()) {
            return;
        }

        handler();
    });
}

bool parseJsonBody(JsonDocument &doc, String *error = nullptr) {
    if (!server.hasArg("plain")) {
        if (error != nullptr) {
            *error = "Missing JSON body";
        }
        return false;
    }

    DeserializationError deserializeError = deserializeJson(doc, server.arg("plain"));
    if (deserializeError) {
        if (error != nullptr) {
            *error = deserializeError.c_str();
        }
        return false;
    }

    if (error != nullptr) {
        *error = "";
    }
    return true;
}

bool imageExtensionAllowed(const String &filename) {
    String lower = filename;
    lower.toLowerCase();
    return lower.endsWith(".jpg") || lower.endsWith(".jpeg");
}

bool sanitizeImagePath(const String &input, String &normalizedPath, String *error = nullptr) {
    String candidate = input;
    candidate.trim();

    if (candidate.length() == 0) {
        normalizedPath = "";
        return true;
    }

    if (!candidate.startsWith(IMAGE_DIR) ||
        candidate.indexOf("..") >= 0 ||
        candidate.indexOf('\\') >= 0 ||
        !imageExtensionAllowed(candidate)) {
        if (error != nullptr) {
            *error = "Invalid image path";
        }
        return false;
    }

    normalizedPath = candidate;
    return true;
}

bool sanitizeUploadFilename(const String &input, String &safeFilename, String *error = nullptr) {
    String filename = input;
    filename.replace("\\", "/");
    int separatorIndex = filename.lastIndexOf('/');
    if (separatorIndex >= 0) {
        filename = filename.substring(separatorIndex + 1);
    }
    filename.trim();

    String sanitized = "";
    for (size_t index = 0; index < filename.length(); ++index) {
        char value = filename[index];
        if (isalnum(static_cast<unsigned char>(value)) || value == '-' || value == '_' || value == '.') {
            sanitized += value;
        } else if (value == ' ') {
            sanitized += '-';
        }
    }

    if (sanitized.length() == 0 || sanitized[0] == '.' || !imageExtensionAllowed(sanitized)) {
        if (error != nullptr) {
            *error = "Invalid JPEG filename";
        }
        return false;
    }

    safeFilename = sanitized;
    return true;
}

void clearCurrentImageSelection() {
    currentImage[0] = '\0';
    displayState.imagePath[0] = '\0';
    displayState.showImage = false;
}

bool setCurrentImageSelection(const String &requestedPath, String *error = nullptr) {
    String imagePath;
    if (!sanitizeImagePath(requestedPath, imagePath, error)) {
        return false;
    }

    if (imagePath.length() > 0 && !LittleFS.exists(imagePath)) {
        if (error != nullptr) {
            *error = "Image not found";
        }
        return false;
    }

    if (imagePath.length() == 0) {
        clearCurrentImageSelection();
        return true;
    }

    strncpy(currentImage, imagePath.c_str(), sizeof(currentImage) - 1);
    currentImage[sizeof(currentImage) - 1] = '\0';
    strncpy(displayState.imagePath, currentImage, sizeof(displayState.imagePath) - 1);
    displayState.imagePath[sizeof(displayState.imagePath) - 1] = '\0';
    displayState.showImage = true;
    return true;
}

bool applyRuntimeSettingsObject(JsonObjectConst settings, bool persist, String *error = nullptr) {
    bool changed = false;
    bool brightnessChanged = false;
    bool timezoneChanged = false;

    if (!settings["brightness"].isNull()) {
        currentBrightness = constrain(settings["brightness"].as<int>(), 0, 100);
        appSettings.brightness = currentBrightness;
        changed = true;
        brightnessChanged = true;
    }

    if (!settings["gmtOffset"].isNull()) {
        long gmtOffset = constrain(settings["gmtOffset"].as<long>(), -12L * 3600L, 14L * 3600L);
        appSettings.gmtOffset = gmtOffset;
        configTime(appSettings.gmtOffset, 0, NTP_SERVER);
        changed = true;
        timezoneChanged = true;
    }

    if (!settings["deviceName"].isNull()) {
        char nextDeviceName[SETTINGS_DEVICE_NAME_LENGTH];
        settingsSanitizeDeviceName(settings["deviceName"].as<const char*>(), nextDeviceName, sizeof(nextDeviceName));
        if (strncmp(appSettings.deviceName, nextDeviceName, sizeof(appSettings.deviceName)) != 0) {
            copyString(appSettings.deviceName, sizeof(appSettings.deviceName), nextDeviceName);
            changed = true;
        }
    }

    if (brightnessChanged || timezoneChanged) {
        applyEffectiveBrightness(brightnessChanged);
    }

    if (persist && changed) {
        settingsSave(appSettings);
        captureSavedSettings();
    }

    if (error != nullptr) {
        *error = "";
    }

