ola31/geekmagic-tv-esp8266/src/webserver.cpp
    return true;
}

bool applyDashboardPayload(JsonDocument &doc, bool persist, String *error = nullptr) {
    JsonObjectConst settings = doc["settings"].as<JsonObjectConst>();
    if (!settings.isNull() && !applyRuntimeSettingsObject(settings, false, error)) {
        return false;
    }

    JsonVariantConst config = doc["config"];
    if (!config.isNull()) {
        String configJson;
        serializeJson(config, configJson);
        if (!dashboardPreviewConfigJson(configJson, error)) {
            return false;
        }
    }

    JsonVariantConst data = doc["data"];
    if (!data.isNull()) {
        String dataJson;
        serializeJson(data, dataJson);
        if (!dashboardPreviewDataJson(dataJson, error)) {
            return false;
        }
    }

    currentTheme = dashboardConfig.theme;
    appSettings.theme = currentTheme;
    if (!dashboardPageEnabled(displayState.currentPage)) {
        displayState.currentPage = dashboardFirstEnabledPage();
    }

    if (persist) {
        if (!dashboardSaveAll()) {
            if (error != nullptr) {
                *error = "Failed to save dashboard";
            }
            return false;
        }
        settingsSave(appSettings);
        captureSavedSettings();
    }

    applyEffectiveBrightness(false);

    if (error != nullptr) {
        *error = "";
    }
    return true;
}

bool applyFeedPayload(JsonDocument &doc, bool persist, String *error = nullptr) {
    String configJson;
    serializeJson(doc.as<JsonVariantConst>(), configJson);
    if (!feedsPreviewConfigJson(configJson, error)) {
        return false;
    }

    if (persist && !feedsSaveConfig()) {
        if (error != nullptr) {
            *error = "Failed to save feed config";
        }
        return false;
    }

    if (error != nullptr) {
        *error = "";
    }
    return true;
}

void performFactoryResetNow() {
    logPrint(F("Performing factory reset..."));
    displayShowMessage(F("Factory reset\nRestarting..."));

    WiFi.disconnect(true);
    delay(100);
    ESP.eraseConfig();
    delay(100);

    settingsInit();
    Settings defaultSettings;
    settingsReset(defaultSettings);
    settingsSave(defaultSettings);
    bootCounterReset();

    LittleFS.format();
    delay(500);
    ESP.restart();
}

void performWiFiReconfigureNow() {
    logPrint(F("Resetting WiFi credentials and restarting to AP mode..."));
    displayShowMessage(F("WiFi reset\nRestarting..."));

    WiFi.disconnect(true);
    delay(100);
    ESP.eraseConfig();
    delay(200);
    ESP.restart();
}

void startQueuedWiFiConnect() {
    if (!wifiConnectTask.queued) {
        return;
    }

    wifiConnectTask.queued = false;
    wifiConnectTask.active = true;
    wifiConnectTask.waitingForIp = false;
    wifiConnectTask.startedAtMs = millis();
    wifiConnectTask.ipWaitStartedAtMs = 0;

    logPrintf("Starting WiFi connect task for SSID: %s", wifiConnectTask.ssid);
    displayState.showImage = false;
    displayState.apMode = false;
    wifiFailsafeMode = false;
    displayShowMessage(String("Connecting\n") + wifiConnectTask.ssid);

    WiFi.persistent(true);
    WiFi.setAutoReconnect(true);
    WiFi.softAPdisconnect(true);
    delay(100);

    WiFi.mode(WIFI_STA);
    delay(100);
    char hostname[SETTINGS_HOSTNAME_LENGTH];
    copyConfiguredHostname(hostname, sizeof(hostname));
    WiFi.hostname(hostname);
    WiFi.begin(wifiConnectTask.ssid, wifiConnectTask.password);
}

void failWiFiConnectTask(const __FlashStringHelper *reason) {
    logPrint(String(F("WiFi connect failed: ")) + String(reason));
    wifiConnectTask.active = false;
    wifiConnectTask.waitingForIp = false;

    WiFi.disconnect(true);
    delay(100);
    WiFi.mode(WIFI_AP);
    WiFi.softAP(WIFI_AP_NAME);  // open - matches setupWiFi so a failed try still leaves a joinable setup AP
    wifiFailsafeMode = true;
    displayShowAPScreen(WIFI_AP_NAME, apPassword.c_str(), WiFi.softAPIP().toString().c_str());
}

void processWiFiConnectTask() {
    if (wifiConnectTask.queued) {
        startQueuedWiFiConnect();
        return;
    }

    if (!wifiConnectTask.active) {
        return;
    }

    if (WiFi.status() == WL_CONNECTED) {
        if (WiFi.localIP() != IPAddress(0, 0, 0, 0)) {
            wifiConnectTask.active = false;
            wifiConnectTask.waitingForIp = false;
            displayShowMessage("WiFi OK\n" + WiFi.localIP().toString());
            delay(1200);
            ESP.restart();
            return;
        }

        if (!wifiConnectTask.waitingForIp) {
            wifiConnectTask.waitingForIp = true;
            wifiConnectTask.ipWaitStartedAtMs = millis();
        } else if (millis() - wifiConnectTask.ipWaitStartedAtMs > kWiFiIpWaitTimeoutMs) {
            failWiFiConnectTask(F("IP timeout"));
        }
        return;
    }

    if (millis() - wifiConnectTask.startedAtMs > kWiFiConnectTimeoutMs) {
        failWiFiConnectTask(F("association timeout"));
    }
}

}  // namespace

void webserverApplyEffectiveBrightness(bool syncPreference) {
    applyEffectiveBrightness(syncPreference);
}

String buildAppJson() {
    char hostName[SETTINGS_HOSTNAME_LENGTH];
    char defaultDeviceName[SETTINGS_DEVICE_NAME_LENGTH];
    copyConfiguredHostname(hostName, sizeof(hostName));
    copyDefaultDeviceName(defaultDeviceName, sizeof(defaultDeviceName));

    String json = "{";
    json += "\"deviceName\":\"" + String(appSettings.deviceName) + "\",";
    json += "\"defaultDeviceName\":\"" + String(defaultDeviceName) + "\",";
    json += "\"hostName\":\"" + String(hostName) + "\",";
    json += "\"theme\":" + String(currentTheme) + ",";
    json += "\"brt\":" + String(currentBrightness) + ",";
    json += "\"img\":\"" + String(currentImage) + "\",";
    json += "\"gmtOffset\":" + String(appSettings.gmtOffset) + ",";
    json += "\"displayDraft\":" + String(displayHasDraftChanges() ? "true" : "false") + ",";
    json += "\"networkBusy\":" + String(webserverHasPendingNetworkAction() ? "true" : "false");
    json += "}";
    return json;
}

String buildSpaceJson() {
    FSInfo fsInfo;
    LittleFS.info(fsInfo);

    String json = "{";
    json += "\"total\":" + String(fsInfo.totalBytes) + ",";
    json += "\"free\":" + String(fsInfo.totalBytes - fsInfo.usedBytes);
    json += "}";
    return json;
}

String buildVersionJson() {
    char hostName[SETTINGS_HOSTNAME_LENGTH];
    copyConfiguredHostname(hostName, sizeof(hostName));

    String json = "{";
    json += "\"version\":\"" + String(FIRMWARE_VERSION_STRING) + "\",";
    json += "\"deviceName\":\"" + String(appSettings.deviceName) + "\",";
    json += "\"hostName\":\"" + String(hostName) + "\"";
    json += "}";
    return json;
}

void handleAppJson() { sendJsonResponse(200, buildAppJson()); }

