ola31/geekmagic-tv-esp8266/src/webserver.cpp
void handleDashboardJson() {
    String json;
    dashboardBuildFullJson(json);
    sendJsonResponse(200, json);
}

void handleFeedsJson() {
    String json;
    feedsBuildStateJson(json);
    sendJsonResponse(200, json);
}

void handleSpaceJson() { sendJsonResponse(200, buildSpaceJson()); }

void handleBrtJson() {
    sendJsonResponse(200, "{\"brt\":\"" + String(currentBrightness) + "\"}");
}

void handleVersionJson() { sendJsonResponse(200, buildVersionJson()); }

// One request for the whole initial state. The browser used to fire five
// concurrent fetches on load; this device serves one connection at a time, so
// on a weak link any single request stalling on a retransmit held up the whole
// page - and five simultaneous sockets sometimes exhausted the server and
// dropped one outright. Folding them into a single object means one round trip.
void handleStateJson() {
    String dashboard;
    dashboardBuildFullJson(dashboard);
    String feeds;
    feedsBuildStateJson(feeds);

    String json = "{\"app\":";
    json += buildAppJson();
    json += ",\"dashboard\":";
    json += dashboard;
    json += ",\"feeds\":";
    json += feeds;
    json += ",\"version\":";
    json += buildVersionJson();
    json += ",\"space\":";
    json += buildSpaceJson();
    json += "}";
    sendJsonResponse(200, json);
}

void handleAuthStatus() {
    char hostName[SETTINGS_HOSTNAME_LENGTH];
    char defaultDeviceName[SETTINGS_DEVICE_NAME_LENGTH];
    copyConfiguredHostname(hostName, sizeof(hostName));
    copyDefaultDeviceName(defaultDeviceName, sizeof(defaultDeviceName));

    bool authenticated = requestHasValidSession();
    if (authenticated) {
        attachSessionCookie(kAuthSessionMaxAgeSec);
    } else if (server.hasHeader("Cookie")) {
        clearSessionCookie();
    }

    String json = "{";
    json += "\"enabled\":true,";
    json += "\"authenticated\":" + String(authenticated ? "true" : "false") + ",";
    json += "\"deviceName\":\"" + String(appSettings.deviceName) + "\",";
    json += "\"defaultDeviceName\":\"" + String(defaultDeviceName) + "\",";
    json += "\"hostName\":\"" + String(hostName) + "\",";
    json += "\"username\":\"" + String(authUsername()) + "\",";
    json += "\"provisionedThisBoot\":" + String(authWasProvisionedThisBoot() ? "true" : "false") + ",";
    json += "\"canRevealPassword\":" + String(authCanRevealPassword() ? "true" : "false");
    json += "}";
    sendJsonResponse(200, json);
}

void handleAuthLogin() {
    JsonDocument doc;
    String error;
    if (!parseJsonBody(doc, &error)) {
        sendTextResponse(400, error);
        return;
    }

    const char *username = doc["username"] | authUsername();
    const char *password = doc["password"] | "";
    if (username == nullptr || String(username) != authUsername()) {
        clearSessionCookie();
        sendTextResponse(401, "Unauthorized");
        return;
    }

    if (!authVerifyPassword(String(password))) {
        clearSessionCookie();
        sendTextResponse(401, "Invalid password");
        return;
    }

    startAuthenticatedSession();
    attachSessionCookie(kAuthSessionMaxAgeSec);
    sendTextResponse(200, "OK");
}

void handleAuthLogout() {
    if (requestHasValidSession()) {
        clearSessionState();
    }
    clearSessionCookie();
    sendTextResponse(200, "OK");
}

void handleAuthReveal() {
    if (!authCanRevealPassword()) {
        sendTextResponse(409,
                         "Custom or older passwords cannot be displayed. If you forgot it, factory reset with 10 quick power cycles.");
        return;
    }

    const char *password = authProvisionedPassword();
    if (password == nullptr || password[0] == '\0') {
        sendTextResponse(409, "No revealable setup password is available.");
        return;
    }

    displayShowTemporaryMessage(String(F("Admin login\n")) + authUsername() + "\n" + password, 15000UL);
    sendTextResponse(200, "Password shown on device for 15 seconds.");
}

void handleAuthPasswordChange() {
    JsonDocument doc;
    String error;
    if (!parseJsonBody(doc, &error)) {
        sendTextResponse(400, error);
        return;
    }

    const char *currentPassword = doc["currentPassword"] | "";
    const char *newPassword = doc["newPassword"] | "";
    if (!authUpdatePassword(String(currentPassword), String(newPassword), &error)) {
        sendTextResponse(400, error.length() > 0 ? error : "Password update failed");
        return;
    }

    clearSessionState();
    clearSessionCookie();
    sendTextResponse(200, "Password updated");
}

void handleDashboardConfigSave() {
    if (!server.hasArg("plain")) {
        sendTextResponse(400, "Missing JSON body");
        return;
    }

    String error;
    if (!dashboardApplyConfigJson(server.arg("plain"), &error)) {
        sendTextResponse(400, "Invalid config: " + error);
        return;
    }

    currentTheme = dashboardConfig.theme;
    if (appSettings.theme != currentTheme) {
        appSettings.theme = currentTheme;
        settingsSave(appSettings);
        captureSavedSettings();
    }
    applyEffectiveBrightness(false);
    displayState.currentPage = dashboardFirstEnabledPage();
    displayUpdate();
    sendTextResponse(200, "OK");
}

void handleDashboardDataSave() {
    if (!server.hasArg("plain")) {
        sendTextResponse(400, "Missing JSON body");
        return;
    }

    String error;
    if (!dashboardApplyDataJson(server.arg("plain"), &error)) {
        sendTextResponse(400, "Invalid data: " + error);
        return;
    }

    displayUpdate();
    sendTextResponse(200, "OK");
}

void handleDashboardReset() {
    dashboardResetToDefaults();
    if (!dashboardSaveAll()) {
        sendTextResponse(500, "Failed to reset dashboard");
        return;
    }

    currentTheme = dashboardConfig.theme;
    if (appSettings.theme != currentTheme) {
        appSettings.theme = currentTheme;
        settingsSave(appSettings);
        captureSavedSettings();
    }
    applyEffectiveBrightness(false);
    displayState.currentPage = dashboardFirstEnabledPage();
    displayUpdate();
    sendTextResponse(200, "OK");
}

void handleDashboardLive() {
    JsonDocument doc;
    String error;
    if (!parseJsonBody(doc, &error)) {
        sendTextResponse(400, error);
        return;
    }

    if (!applyDashboardPayload(doc, false, &error)) {
        sendTextResponse(400, error);
        return;
    }

    displayUpdate();
    sendTextResponse(200, "OK");
}

void handleDashboardSave() {
    String error;
    if (server.hasArg("plain")) {
        JsonDocument doc;
        if (!parseJsonBody(doc, &error)) {
            sendTextResponse(400, error);
            return;
        }

        if (!applyDashboardPayload(doc, true, &error)) {
            sendTextResponse(500, error);
            return;
        }
    } else {
        appSettings.theme = dashboardConfig.theme;
        if (!dashboardSaveAll()) {
            sendTextResponse(500, "Failed to save dashboard");
            return;
        }
        settingsSave(appSettings);
        captureSavedSettings();
        applyEffectiveBrightness(false);
    }

    displayUpdate();
    sendTextResponse(200, "OK");
}

void handleDashboardDiscard() {
    dashboardDiscardDraftChanges();
    restoreSavedDisplaySettings();
    currentTheme = dashboardConfig.theme;
    appSettings.theme = currentTheme;
    if (!dashboardPageEnabled(displayState.currentPage)) {
        displayState.currentPage = dashboardFirstEnabledPage();
    }
    displayUpdate();
    sendTextResponse(200, "OK");
}

void handleFeedsLive() {
    JsonDocument doc;
    String error;
    if (!parseJsonBody(doc, &error)) {
        sendTextResponse(400, error);
        return;
    }

    if (!applyFeedPayload(doc, false, &error)) {
        sendTextResponse(400, error);
        return;
    }

    displayUpdate();
    sendTextResponse(200, "OK");
}

void handleFeedsSave() {
    String error;
    if (server.hasArg("plain")) {
        JsonDocument doc;
        if (!parseJsonBody(doc, &error)) {
            sendTextResponse(400, error);
            return;
        }

        if (!applyFeedPayload(doc, true, &error)) {
            sendTextResponse(500, error);
            return;
        }
    } else if (!feedsSaveConfig()) {
        sendTextResponse(500, "Failed to save feed config");
        return;
    }

    sendTextResponse(200, "OK");
}

void handleFeedsDiscard() {
    feedsDiscardDraftChanges();
    displayUpdate();
    sendTextResponse(200, "OK");
}

void handleFeedsReset() {
    feedsResetToDefaults();
    if (!feedsSaveConfig()) {
        sendTextResponse(500, "Failed to reset feed config");
        return;
    }

    displayUpdate();
    sendTextResponse(200, "OK");
}

