ola31/geekmagic-tv-esp8266/src/webserver.cpp
void handleFeedsSync() {
    String scope = server.hasArg("scope") ? server.arg("scope") : "all";
    String error;
    if (!feedsSyncNow(scope.c_str(), &error)) {
        sendTextResponse(502, error.length() > 0 ? error : "Feed sync failed");
        return;
    }

    displayUpdate();
    String json;
    feedsBuildStateJson(json);
    sendJsonResponse(200, json);
}

void handleFeedSearch() {
    if (!server.hasArg("query")) {
        sendTextResponse(400, "Missing query parameter");
        return;
    }

    String query = server.arg("query");
    query.trim();
    if (query.length() < 2) {
        sendTextResponse(400, "Enter at least 2 characters");
        return;
    }

    String json;
    String error;
    if (!feedsSearchWeatherLocations(query, json, &error)) {
        sendTextResponse(502, error.length() > 0 ? error : "Search failed");
        return;
    }

    sendJsonResponse(200, json);
}

void handleFileUpload() {
    HTTPUpload &upload = server.upload();

    if (upload.status == UPLOAD_FILE_START) {
        uploadErrorMessage = "";
        uploadStatusCode = 200;
        uploadTargetPath[0] = '\0';

        String safeFilename;
        if (!sanitizeUploadFilename(upload.filename, safeFilename, &uploadErrorMessage)) {
            uploadStatusCode = 400;
            logPrintf("ERROR: Upload rejected: %s", uploadErrorMessage.c_str());
            return;
        }

        String filePath = String(IMAGE_DIR) + safeFilename;
        strncpy(uploadTargetPath, filePath.c_str(), sizeof(uploadTargetPath) - 1);
        uploadTargetPath[sizeof(uploadTargetPath) - 1] = '\0';
        uploadFile = LittleFS.open(uploadTargetPath, "w");

        if (!uploadFile) {
            uploadStatusCode = 500;
            uploadErrorMessage = "Failed to open upload target";
            logPrintf("ERROR: Failed to open file %s for writing", uploadTargetPath);
            uploadTargetPath[0] = '\0';
        } else {
            logPrintf("INFO: Upload started for %s", uploadTargetPath);
        }
    } else if (upload.status == UPLOAD_FILE_WRITE) {
        if (uploadFile) {
            uploadFile.write(upload.buf, upload.currentSize);
        }
    } else if (upload.status == UPLOAD_FILE_ABORTED) {
        if (uploadFile) {
            uploadFile.close();
        }
        if (uploadTargetPath[0] != '\0') {
            LittleFS.remove(uploadTargetPath);
        }
        uploadStatusCode = 400;
        uploadErrorMessage = "Upload aborted";
        uploadTargetPath[0] = '\0';
    } else if (upload.status == UPLOAD_FILE_END) {
        if (uploadFile) {
            uploadFile.close();
            logPrintf("INFO: Upload complete: %s (%u bytes)", uploadTargetPath, upload.totalSize);
        }
    }
}

void handleUploadDone() {
    String message = uploadErrorMessage.length() > 0
                         ? uploadErrorMessage
                         : (uploadTargetPath[0] != '\0' ? String(uploadTargetPath) : String("OK"));
    sendTextResponse(uploadStatusCode, message);
    uploadErrorMessage = "";
    uploadStatusCode = 200;
    uploadTargetPath[0] = '\0';
}

void handleDelete() {
    JsonDocument doc;
    String error;
    String filePath = server.hasArg("file") ? server.arg("file") : "";
    if (server.hasArg("plain")) {
        if (!parseJsonBody(doc, &error)) {
            sendTextResponse(400, error);
            return;
        }
        filePath = doc["file"] | filePath;
    }

    String normalizedPath;
    if (!sanitizeImagePath(filePath, normalizedPath, &error) || normalizedPath.length() == 0) {
        sendTextResponse(400, error.length() > 0 ? error : "Missing file parameter");
        return;
    }

    if (!LittleFS.remove(normalizedPath)) {
        sendTextResponse(404, "Not found");
        return;
    }

    if (String(currentImage) == normalizedPath) {
        clearCurrentImageSelection();
    }

    sendTextResponse(200, "Deleted");
}

void handleImageShow() {
    JsonDocument doc;
    String error;
    if (!parseJsonBody(doc, &error)) {
        sendTextResponse(400, error);
        return;
    }

    if (!setCurrentImageSelection(doc["path"] | "", &error)) {
        sendTextResponse(400, error);
        return;
    }

    displayUpdate();
    sendTextResponse(200, "OK");
}

void handleApiUpdate() {
    if (!server.hasArg("plain")) {
        sendTextResponse(400, "No JSON body");
        return;
    }

    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, server.arg("plain"));
    if (error) {
        sendTextResponse(400, "Invalid JSON");
        return;
    }

    if (!doc["line1"].isNull()) {
        strncpy(displayState.line2, doc["line1"].as<const char*>(), sizeof(displayState.line2) - 1);
        displayState.line2[sizeof(displayState.line2) - 1] = '\0';
    } else {
        displayState.line2[0] = '\0';
    }

    displayState.showImage = false;
    displayUpdate();
    sendTextResponse(200, "OK");
}

void handleTestCard() {
    clearCurrentImageSelection();
    displayState.apMode = false;
    displayState.line2[0] = '\0';
    displayState.currentPage = DASHBOARD_PAGE_CLOCK;
    displayUpdate();
    sendTextResponse(200, "OK");
}

void handleReconfigureWiFi() {
    if (webserverHasPendingNetworkAction()) {
        sendTextResponse(409, "Another network task is already running");
        return;
    }

    wifiReconfigurePending = true;
    sendTextResponse(202, "WiFi credentials will be cleared. Device restarting to AP mode.");
}

void handleFactoryReset() {
    factoryResetPending = true;
    sendTextResponse(202, "Factory reset requested. Device will restart shortly.");
}

void handleOTAForm() {
    prepareNoStoreHeaders();
    server.send_P(200, "text/html", ota_html);
}

bool otaStrict = false;

void handleOTAUpload() {
    HTTPUpload &upload = server.upload();

    if (upload.status == UPLOAD_FILE_START) {
        displayShowMessage("OTA Update...");
        uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
        // Never stage more than the bootable application slot holds (0x001000..
        // 0x100000). A larger image could not boot anyway, and the free-space
        // figure alone allows far more than the slot, so bound it explicitly.
        constexpr uint32_t kAppSlotSize = 0xFF000u;
        if (maxSketchSpace > kAppSlotSize) {
            maxSketchSpace = kAppSlotSize;
        }
        uint32_t declared = server.hasArg("size") ? server.arg("size").toInt() : 0;
        otaStrict = declared > 0 && declared <= maxSketchSpace;
        if (!Update.begin(otaStrict ? declared : maxSketchSpace)) {
            Update.printError(Serial);
            return;
        }

        // A checksum turns a truncated upload into a clean refusal. Without one
        // the update is accepted on whatever arrived, which is how a half
        // written image ends up in the boot slot and bricks the device.
        if (server.hasArg("md5")) {
            String expected = server.arg("md5");
            expected.trim();
            expected.toLowerCase();
            if (expected.length() == 32 && Update.setMD5(expected.c_str())) {
                logPrintf("OTA expecting md5 %s", expected.c_str());
            } else {
                logPrint(F("OTA rejected: malformed md5"));
                Update.end(false);
            }
        } else {
            logPrint(F("OTA without md5 - size check only"));
        }
    } else if (upload.status == UPLOAD_FILE_WRITE) {
        if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
            Update.printError(Serial);
        }
    } else if (upload.status == UPLOAD_FILE_END) {
        // No "evenIfRemaining": the write must be complete, and the checksum
        // must match, or nothing is committed.
        if (Update.end(!otaStrict)) {
            displayShowMessage("OTA complete");
            logPrintf("OTA verified, %u bytes", upload.totalSize);
        } else {
            Update.printError(Serial);
            displayShowMessage("OTA failed");
            logPrint(F("OTA refused - image not committed"));
        }
    } else if (upload.status == UPLOAD_FILE_ABORTED) {
        Update.end(false);
        displayShowMessage("OTA aborted");
        logPrint(F("OTA aborted by client"));
    }
}

void handleOTADone() {
    // Only a finished, verified image earns a reboot.
    bool shouldReboot = Update.isFinished() && !Update.hasError();
    sendTextResponse(200, shouldReboot ? "OK - Rebooting..." : "FAIL");

    if (shouldReboot) {
        // An OTA reboot is intentional, not a crash. Clear the boot-failure
        // counter first so a successful update - including the bootstrap->full
        // install hop and every later OTA - never counts toward crash-loop
        // recovery. Without this, the reboots a normal install goes through
        // could accumulate to the recovery threshold and boot the fresh device
        // straight into recovery mode with feed sync and NTP disabled.
        bootCounterReset();
        delay(1000);
        ESP.restart();
    }
}

void handleLog() {
    sendTextResponse(200, logGetAll());
}

