ola31/geekmagic-tv-esp8266/src/webserver.cpp
void handleReboot() {
    sendTextResponse(200, "Rebooting");
    // A user-requested reboot is intentional, so it must not count as a boot
    // failure either.
    bootCounterReset();
    delay(200);
    ESP.restart();
}

void handleWiFiScan() {
    int networkCount = WiFi.scanNetworks(false, true);
    JsonDocument doc;
    JsonArray networks = doc.to<JsonArray>();
    for (int index = 0; index < networkCount; ++index) {
        JsonObject network = networks.add<JsonObject>();
        network["ssid"] = WiFi.SSID(index);
        network["rssi"] = WiFi.RSSI(index);
        network["encryption"] = WiFi.encryptionType(index);
    }

    String json;
    serializeJson(doc, json);
    WiFi.scanDelete();
    sendJsonResponse(200, json);
}

void handleWiFiConnect() {
    if (webserverHasPendingNetworkAction()) {
        sendTextResponse(409, "Another network task is already running");
        return;
    }

    JsonDocument doc;
    String error;
    if (!parseJsonBody(doc, &error)) {
        sendTextResponse(400, error);
        return;
    }

    const char *ssid = doc["ssid"];
    const char *password = doc["password"] | "";
    if (ssid == nullptr || ssid[0] == '\0') {
        sendTextResponse(400, "Missing SSID");
        return;
    }

    copyString(wifiConnectTask.ssid, sizeof(wifiConnectTask.ssid), ssid);
    copyString(wifiConnectTask.password, sizeof(wifiConnectTask.password), password);
    wifiConnectTask.queued = true;
    sendTextResponse(202, "Connection started. Device will restart if successful.");
}

// Self-contained WiFi setup page for the AP/recovery state. It depends on
// neither the bundled SPA nor a login, so it works even when the only secret a
// device would otherwise need is trapped on a screen that no longer displays.
static const char kSetupHtml[] PROGMEM =
    "<!doctype html><html><head><meta charset=utf-8>"
    "<meta name=viewport content='width=device-width,initial-scale=1'>"
    "<title>SmallTV WiFi Setup</title><style>"
    "body{font-family:system-ui,sans-serif;max-width:26rem;margin:2rem auto;padding:0 1rem;background:#111;color:#eee}"
    "h2{font-weight:600}select,input,button{width:100%;box-sizing:border-box;padding:.6rem;margin:.3rem 0;"
    "border-radius:.4rem;border:1px solid #444;background:#1c1c1c;color:#eee;font-size:1rem}"
    "button{background:#2d6cdf;border:0;font-weight:600;cursor:pointer}#s{margin-top:.8rem;min-height:1.2rem;color:#9cf}"
    "</style></head><body><h2>WiFi Setup</h2>"
    "<button onclick=scan()>Scan networks</button>"
    "<select id=n><option value=''>-- pick a network --</option></select>"
    "<input id=ssid placeholder='or type SSID'>"
    "<input id=pw type=password placeholder='WiFi password'>"
    "<button onclick=save()>Connect</button><div id=s></div>"
    "<script>"
    "var S=document.getElementById('s');"
    "function scan(){S.textContent='Scanning...';fetch('/scan').then(r=>r.json()).then(a=>{"
    "var n=document.getElementById('n');n.length=1;a.sort((x,y)=>y.rssi-x.rssi).forEach(w=>{"
    "if(!w.ssid)return;var o=document.createElement('option');o.value=w.ssid;o.textContent=w.ssid+' ('+w.rssi+')';n.add(o)});"
    "S.textContent=a.length+' networks';}).catch(e=>S.textContent='Scan failed');}"
    "document.getElementById('n').onchange=function(){document.getElementById('ssid').value=this.value;};"
    "function save(){var s=document.getElementById('ssid').value||document.getElementById('n').value;"
    "if(!s){S.textContent='Enter a network';return;}S.textContent='Connecting...';"
    "fetch('/connect',{method:'POST',headers:{'Content-Type':'application/json'},"
    "body:JSON.stringify({ssid:s,password:document.getElementById('pw').value})})"
    ".then(r=>r.text()).then(t=>{S.textContent=t+' The device will restart if it works.';})"
    ".catch(e=>S.textContent='Request failed');}"
    "</script></body></html>";

void handleSetupPage() {
    prepareNoStoreHeaders();
    server.send_P(200, "text/html", kSetupHtml);
}

void handleRoot() {
    // In the setup AP state, serve the self-contained setup page instead of the
    // SPA: the SPA gates everything behind a login whose password may only exist
    // on a failed screen, which is exactly the lock-out this avoids.
    if (webserverInSetupMode()) {
        handleSetupPage();
        return;
    }

    if (requestHasValidSession()) {
        attachSessionCookie(kAuthSessionMaxAgeSec);
    } else if (server.hasHeader("Cookie")) {
        clearSessionCookie();
    }

    prepareNoStoreHeaders();
    server.send_P(200, "text/html", index_html);
}

void webserverInit() {
    static const char* kCollectedHeaders[] = {"Cookie"};

    currentTheme = dashboardConfig.theme;
    appSettings.theme = currentTheme;
    captureSavedSettings();
    server.collectHeaders(kCollectedHeaders, sizeof(kCollectedHeaders) / sizeof(kCollectedHeaders[0]));

    server.on("/", HTTP_GET, handleRoot);
    server.on("/auth/status", HTTP_GET, handleAuthStatus);
    server.on("/auth/login", HTTP_POST, handleAuthLogin);
    server.on("/auth/logout", HTTP_POST, handleAuthLogout);
    server.on("/auth/reveal", HTTP_POST, handleAuthReveal);

    registerProtectedRoute("/state.json", HTTP_GET, handleStateJson);
    registerProtectedRoute("/app.json", HTTP_GET, handleAppJson);
    registerProtectedRoute("/dashboard.json", HTTP_GET, handleDashboardJson);
    registerProtectedRoute("/feeds.json", HTTP_GET, handleFeedsJson);
    registerProtectedRoute("/space.json", HTTP_GET, handleSpaceJson);
    registerProtectedRoute("/brt.json", HTTP_GET, handleBrtJson);
    registerProtectedRoute("/version.json", HTTP_GET, handleVersionJson);
    registerProtectedRoute("/delete", HTTP_POST, handleDelete);
    registerProtectedRoute("/log", HTTP_GET, handleLog);
    registerProtectedRoute("/reboot", HTTP_POST, handleReboot);
    registerProtectedRoute("/reconfigurewifi", HTTP_POST, handleReconfigureWiFi);
    registerProtectedRoute("/factoryreset", HTTP_POST, handleFactoryReset);
    // Setup routes: open only while offering the setup AP, so a device with no
    // network (or a dead screen) can still be pointed at a WiFi network.
    registerSetupRoute("/setup", HTTP_GET, handleSetupPage);
    registerSetupRoute("/scan", HTTP_GET, handleWiFiScan);
    registerSetupRoute("/connect", HTTP_POST, handleWiFiConnect);
    registerProtectedRoute("/test", HTTP_POST, handleTestCard);
    registerProtectedRoute("/image/show", HTTP_POST, handleImageShow);
    registerProtectedRoute("/dashboard/config", HTTP_POST, handleDashboardConfigSave);
    registerProtectedRoute("/dashboard/data", HTTP_POST, handleDashboardDataSave);
    registerProtectedRoute("/dashboard/live", HTTP_POST, handleDashboardLive);
    registerProtectedRoute("/dashboard/save", HTTP_POST, handleDashboardSave);
    registerProtectedRoute("/dashboard/discard", HTTP_POST, handleDashboardDiscard);
    registerProtectedRoute("/dashboard/reset", HTTP_POST, handleDashboardReset);
    registerProtectedRoute("/feeds/live", HTTP_POST, handleFeedsLive);
    registerProtectedRoute("/feeds/save", HTTP_POST, handleFeedsSave);
    registerProtectedRoute("/feeds/discard", HTTP_POST, handleFeedsDiscard);
    registerProtectedRoute("/feeds/reset", HTTP_POST, handleFeedsReset);
    registerProtectedRoute("/feeds/sync", HTTP_POST, handleFeedsSync);
    registerProtectedRoute("/feeds/search", HTTP_GET, handleFeedSearch);
    registerProtectedRoute("/api/update", HTTP_POST, handleApiUpdate);
    registerProtectedRoute("/api/dashboard", HTTP_POST, handleDashboardDataSave);
    registerProtectedRoute("/auth/password", HTTP_POST, handleAuthPasswordChange);

    server.on("/image/upload", HTTP_POST,
              []() {
                  if (!ensureAuthenticatedRequest()) {
                      return;
                  }
                  handleUploadDone();
              },
              []() {
                  if (!requestHasValidSession()) {
                      return;
                  }
                  handleFileUpload();
              });
    server.on("/doUpload", HTTP_POST,
              []() {
                  if (!ensureAuthenticatedRequest()) {
                      return;
                  }
                  handleUploadDone();
              },
              []() {
                  if (!requestHasValidSession()) {
                      return;
                  }
                  handleFileUpload();
              });
    server.on("/update", HTTP_GET, []() {
        if (!ensureAuthenticatedRequest()) {
            return;
        }
        handleOTAForm();
    });
    server.on("/update", HTTP_POST,
              []() {
                  if (!ensureAuthenticatedRequest()) {
                      return;
                  }
                  handleOTADone();
              },
              []() {
                  if (!requestHasValidSession()) {
                      return;
                  }
                  handleOTAUpload();
              });

    server.begin();
    Serial.println(F("Web server started"));
}

void webserverHandle() {
    server.handleClient();
}

void webserverProcessPendingActions() {
    if (factoryResetPending) {
        factoryResetPending = false;
        performFactoryResetNow();
        return;
    }

    if (wifiReconfigurePending) {
        wifiReconfigurePending = false;
        performWiFiReconfigureNow();
        return;
    }

    processWiFiConnectTask();
}

bool webserverHasPendingNetworkAction() {
    return factoryResetPending ||
           wifiReconfigurePending ||
           wifiConnectTask.queued ||
           wifiConnectTask.active;
}
